In [1]:
# 7.1 Handling Missing Data

In [2]:
# for data with float64 dtype, pandas uses the floating-point value NaN (Not a Number) to represent misssing data
# this is called  asentienl value; when present, it indicates a missing (or null) value
import pandas as pd
import numpy as np

float_data = pd.Series([1.2,-3.5,np.nan,0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
# .isna() gives a Boolean Series of result; null = TRUE
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
# as alternative to 'NA', a built-in 'None' (case-sensitive) value is also used
string_data = pd.Series(["aardvark",np.nan,None,"avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data = pd.Series([1,2,None],dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [8]:
# NA handling object methods
# .dropna() : filter axis labels based on whether values for eahc label have missing data
#          with varying thresholds for how much missing data to tolerate
# .fillna() : fill in missing data with some value or using an interpolation method such as "ffill" or "bfill"
# .isna() : return Boolean values indicating which values are missing/NA
# .notna() : negation of isna, returns True for non-NA values and False for NA values

In [9]:
# Filtering Out Missing Data

In [10]:
# using .dropna() in Series
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
# another way to filter out missing data in Series
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
# removing missing data in DataFrames - either drop rows or columns that are all NA, or only dropping rows or columns containing any NA
# .dropna() by default drops any row containing a missing value
data = pd.DataFrame([[1,6.5,3.],[1.,np.nan,np.nan],
                     [np.nan,np.nan,np.nan],[np.nan,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna()
# drops all the rows containing any NA

     0    1    2
0  1.0  6.5  3.0

In [15]:
# passing how = "all" will drop only rows that are all NA
data.dropna(how="all")

# these functions don't modify the original object, just creates a new object

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# to drop columns containing NA, pass the argument axis = "columns"
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis="columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
# only keeping rows contianing at most a certain number of missing observations
# indicate this with the thresh argument
df = pd.DataFrame(np.random.standard_normal((7,3)))
df

          0         1         2
0 -0.378818  0.904683 -0.051864
1  0.468146  0.999144 -0.375660
2  0.777286 -0.467365  0.039643
3 -0.252351 -0.380309  0.359793
4  0.109916 -1.660987  0.277953
5  1.079318 -0.598838  1.266582
6  1.391814  0.023173 -0.531789

In [19]:
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0 -0.378818       NaN       NaN
1  0.468146       NaN       NaN
2  0.777286       NaN  0.039643
3 -0.252351       NaN  0.359793
4  0.109916 -1.660987  0.277953
5  1.079318 -0.598838  1.266582
6  1.391814  0.023173 -0.531789

In [20]:
df.dropna()

          0         1         2
4  0.109916 -1.660987  0.277953
5  1.079318 -0.598838  1.266582
6  1.391814  0.023173 -0.531789

In [21]:
# using argument thresh
df.dropna(thresh=2)
# thresh = 2 means non-NaN threshold is 2 (at least 2 non-NaN values), if threshold not met, drop
# thresh = N means the row needs N "votes" to stay in the DataFrame

          0         1         2
2  0.777286       NaN  0.039643
3 -0.252351       NaN  0.359793
4  0.109916 -1.660987  0.277953
5  1.079318 -0.598838  1.266582
6  1.391814  0.023173 -0.531789

In [22]:
# Filling In Missing Data

In [23]:
# .fillna() : filling NaN with a constant
df.fillna(0)

          0         1         2
0 -0.378818  0.000000  0.000000
1  0.468146  0.000000  0.000000
2  0.777286  0.000000  0.039643
3 -0.252351  0.000000  0.359793
4  0.109916 -1.660987  0.277953
5  1.079318 -0.598838  1.266582
6  1.391814  0.023173 -0.531789

In [24]:
# using fillna() with a dictioinary, can use a different fill value for each column
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.378818  0.500000  0.000000
1  0.468146  0.500000  0.000000
2  0.777286  0.500000  0.039643
3 -0.252351  0.500000  0.359793
4  0.109916 -1.660987  0.277953
5  1.079318 -0.598838  1.266582
6  1.391814  0.023173 -0.531789

In [25]:
# the same interpolation methods available for reindexing can be used with fillna()
df = pd.DataFrame(np.random.standard_normal((6,3)))
df

          0         1         2
0 -0.250673 -1.947292 -0.930743
1 -0.445494  2.096768  0.574941
2 -0.774378 -1.738838  0.964542
3  0.842844  0.778174 -0.030937
4  0.072991  1.854048 -0.760480
5  1.354847  1.091888 -1.544406

In [26]:
df.iloc[2:,1] = np.nan
df

          0         1         2
0 -0.250673 -1.947292 -0.930743
1 -0.445494  2.096768  0.574941
2 -0.774378       NaN  0.964542
3  0.842844       NaN -0.030937
4  0.072991       NaN -0.760480
5  1.354847       NaN -1.544406

In [27]:
df.iloc[4:,2] = np.nan
df

          0         1         2
0 -0.250673 -1.947292 -0.930743
1 -0.445494  2.096768  0.574941
2 -0.774378       NaN  0.964542
3  0.842844       NaN -0.030937
4  0.072991       NaN       NaN
5  1.354847       NaN       NaN

In [28]:
df.fillna(method="ffill")
# "ffill" means forward fill; as in Excel "Duplicate Down"
# the NaN values are filled with the preceding non-NaN values, however, ffill stops when it hits a new non-NaN value
# opposite of "ffill" is "bfill" (back fill)

          0         1         2
0 -0.250673 -1.947292 -0.930743
1 -0.445494  2.096768  0.574941
2 -0.774378  2.096768  0.964542
3  0.842844  2.096768 -0.030937
4  0.072991  2.096768 -0.030937
5  1.354847  2.096768 -0.030937

In [29]:
df.fillna(method="ffill",limit=2)

# "limit = 2" means limit the fill to 2 rows

          0         1         2
0 -0.250673 -1.947292 -0.930743
1 -0.445494  2.096768  0.574941
2 -0.774378  2.096768  0.964542
3  0.842844  2.096768 -0.030937
4  0.072991       NaN -0.030937
5  1.354847       NaN -0.030937

In [30]:
# with .fillna() simple data imputation using median or mean statistics is available
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [31]:
data.fillna(data.mean())
# fill the NaN values with .mean()

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [32]:
# .fillna() function arguments
# value : scalar value or dictionary-like object to use to fill missing values
# method : interpolation method - one of "bfill" or "ffill"; default is None
# axis : axis to fill on ("index" or "columns"); default is axis="index"
# limit : for ffill and bfill, maximum number of consecutive periods to fill

In [33]:
# Data Transformation

In [34]:
# Removing Duplicates

In [35]:
# removing duplicate rows
data = pd.DataFrame({"k1":["one","two"]*3 + ["two"],"k2":[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
# DataFrame .duplicated() method returns a Boolean Series indicating whether each row is a duplicate oe nor
# duplicate means its column values are exactly equal to those in an earlier row
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
# relatedly, drop_duplicates() returns a DataFrame with rows where the duplicated array is False filtered out
data.drop_duplicates()

# both methods, .duplicated() and .drop_duplicates() by default consider all of the columns;
# alternatively, can specify any subset of them to detect duplicates

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
# having an additional column of values, and want to filter duplicates based only on the "k1" column
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
# set column with subset argument
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
# .duplicated() and .drop_duplicates() by default keep the first observed value combination
# passing keep="last" argument will return the last one
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [41]:
# Transformming Dta Using a Function or Mapping
# transformation based on the values in an array, Series, or column in a DataFrame
data = pd.DataFrame({"food":["bacon","pulled pork","bacon","pastrami","corned beef","bacon","pastrami","honey ham","nova lox"],
                     "ounces":[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
# suppose we wanted to add a column indicating the type of animal for each food
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon"
}

meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [43]:
# .map() method on a Series accepts a function or dictionary-like object containing a mapping
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
# could also have passed a function that does all the work
def get_animal(x):
    return meat_to_animal[x]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
# using .map() is a convenient way to perform element-wise transformatioins and other data cleaning-related operations

In [46]:
# Replacing Values
# .map() can be used to modify a subset of values in an object,
# but .replace() provides a simpler and more flexible way
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
# using "-999" values as sentinel values for missing data - replacing those with NA values
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
# replacing multiple values at once - passing a list with substitute values
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [49]:
# replacing different values for each, pass a list of substitutes
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
# passing argument can also be a dictionary
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
# renaming axis indexes
# axis labels can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects
# modifying the axes in place without creating a new data structure
data = pd.DataFrame(np.arange(12).reshape((3,4)),
        index = ["ohio","Colorado","New York"],
        columns = ["one","two","three","four"])
data

          one  two  three  four
ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [52]:
# .map() method for axis indexes, just like in Series
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [53]:
# can assign to the index attribute, modifying the DataFrame in place
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [54]:
# if wanting to create a transformed version without modifying the origina, .renam() can be used
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [55]:
# .rename() can be used in conjuction with a dictionary-like object
data.rename(index={"OHIO":"INDIANA"},
           columns={"three":"peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [56]:
# Discretization and Binning
# data about a group of people in a study, gropuping them into discreet age buckets
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [57]:
# bins = 18 to 25, 26 to 35, 36 to 60, and 61 and older
# use pd.cut()
bins = [18,25,35,60,100]
age_categories = pd.cute(ages,bins)
age_categories

AttributeError: module 'pandas' has no attribute 'cute'

In [ ]:
bins = [18,25,35,60,100]
age_categories = pd.cut(ages,bins)
age_categories
# each bin is identified by a special interval value type containing lower and upper limit of each bin

In [ ]:
# data codified in numberical integers (the "pointer" to the category)
age_categories.codes

In [ ]:
# index of unique labels created; telling what the buckets are called, the "reference table"
age_categories.categories

In [ ]:
age_categories.categories[0]

In [ ]:
# pd.value_counts() are the bin counts for the result of pd.cut()
pd.value_counts(age_categories)

In [ ]:
# in the string representation of an interval, a parenthesis means that the side is open (exclusive)
# square bracket means it's closed (inclusive)
# can change which side is closed by passing "right = False"
pd.cut(ages,bins,right=False)

In [ ]:
# can overrid the default interval-based bin labeling, by passing a list or arroy to the labels
group_names = ["Youth","YoungAdult","MiddleAged","Senior"]
pd.cut(ages,bins,labels=group_names)

In [ ]:
# passing an integer number of bins to pd.cut() instead of explicit bin edges,
# it will compute equal-length bins based on min and max values
data = np.random.uniform(size=20)
data

In [ ]:
pd.cut(data,4,precision=2)

In [ ]:
# pd.qcut() bins the data based on sample quantiles
# it will obtain roughly equally sized bins (slicing in quantiles)
data = np.random.standard_normal(1000)
data

In [ ]:
quartiles = pd.qcut(data,4,precision=2)
quartiles

In [ ]:
pd.value_counts(quartiles)

In [ ]:
# similar to pd.cut(), can pass own quantiles (between 0 and 1, inclusive)
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

In [ ]:
# Detecting and Filetering Outliers
# filtering and transforming relates applying array operations
data = pd.DataFrame(np.random.standard_normal((1000,4)))
data

In [ ]:
data.describe()

In [ ]:
# filtering values in one of the columns exceeding 3 in absolute value
col = data[2]
col[col.abs() > 3]

In [ ]:
# selecting rows having a value exceeding 3 or -3, can use any method on a Boolean DataFrame
data[(data.abs() > 3).any(axis="columns")]
# .any() asks if there is any TRUE value in the axis (axis="columns" in this case)
# .all() asks if all of the values TRUE

In [ ]:
# capping values outside the interval -3 to 3
data[data.abs() > 3] = np.sign(data)*3
data

# np.sign(data) produces 1 and -1 values based on wheter the values in data are positive or negative

In [ ]:
data.describe()

In [ ]:
# np.sign(data) produces 1 and -1 values based on wheter the values in data are positive or negative
np.sign(data).head()

In [ ]:
# Permutation and Random Sampling
# permuting (randomly reordering) the rows in a DataFrame
# np.random.permuitation() with length of the axis wanting to permute prodcues an array of integers of new ordering
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))
df

In [ ]:
sampler = np.random.permutation(5)
sampler

In [ ]:
# array can then be used in iloc-based indexing or the equivalent .take() function
df.take(sampler)

In [ ]:
df.iloc[sampler]

In [ ]:
# by invoking .take() with axis="columns", can also select a permutation of the columns
column_sampler = np.random.permutation(7)
column_sampler

In [ ]:
df.take(column_sampler,axis="columns")

In [ ]:
# np.random.permutation() is simply generating random array of integers in random order
np.random.permutation(15)

In [ ]:
# to select a random subset without replacement (the same row cannot appear twice)
# can use .sample() on Series and DataFrame
# "n=" seems to be number of rows
df.sample(n=3)

In [ ]:
# to generate sample WITH replacement (to allow repeat choices)
# pass "replace=True" to .sample()
choices = pd.Series([5,7,-1,6,4])
choices.sample(n=10,replace=True)

In [ ]:
# Computing Indicator / Dummy Variables
# common statistical modeling or machine learning application
# converting a categorical variable into a dummy or indicator matrix
# if column in a DataFrame has k distinct values, derive a matrix or DataFrame with k column containing all 1s and 0s
# pd.get_dummires() 
df = pd.DataFrame({"key":["b","b","a","c","a","b"],
                  "data1":range(6)})
df

In [ ]:
pd.get_dummies(df["key"])

In [ ]:
# in some cases, adding a prefix to the columns in the indicator DataFrame could be helpful
# prefix can e merged with the other data
# pd.get_dummies() has a prefix argument
dummies = pd.get_dummies(df["key"],prefix="shit")
dummies

In [ ]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

In [ ]:
# if row in a DataFrame belongs to multiple categories, use different approach to create dummy varaiables
mnames = ["movie_id","title","genres"]

In [ ]:
movies = pd.read_table("datasets/movielens/movies.dat",sep="::",
                      header=None,names=mnames,engine="python")
movies[:10]

In [ ]:
# pandas has a special Series method str.get_dummies() (methods that start with string)
# multiple group membership encoded as a delimited string
dummies = movies["genres"].str.get_dummies("|")
dummies

In [ ]:
dummies.iloc[:10,:6]

In [ ]:
# as before, can combine this with movies while adding a "Genre_" to the column names in dummies DataFrame
# .add_prefix()
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic

In [ ]:
# for much larger data, this method is not especially speedy
# it would be better to write a lower-level function that writes directly to a Numpy array
# and wrap the result in a DataFrame

In [ ]:
# a useful recipe for statistical application is to combine pd.get_dummies() with pd.cut()
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)
values

In [ ]:
bins = [0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values,bins))

In [ ]:
# 7.3 Extension Data Types
# Numpy has some disagreeing aspects with Pandas
# such as for NaN, pandas converted the data type to float64 and used np,nan
# this has compounding effects by introducing subtle issues
# datasets with a lot of string data were computationally expensive and use a lot of memory
# recently, pandas has developed an extention type system independent to NumPy
# creating and example Series with missing value
s = pd.Series([1,2,3,None])
s

In [ ]:
s.dtype
# for backward compatibility, Series use legacy behavior of using float64 data type and np.nan for missing value

In [ ]:
# Creating Series wiht pd.Int64Dtype()
s = pd.Series([1,2,3,None],dtype=pd.Int64Dtype())
s

In [ ]:
s.isna()
# NA means value is missing for extension type array

In [ ]:
s[3]

In [ ]:
s[3] is pd.NA

In [ ]:
# we also could have used the shorthand "Int64" instead of pd.Int64Dtype() to specify type
s = pd.Series([1,2,3,None],dtype="Int64")
s

In [ ]:
s = pd.Series(['one','two',None,'three'],dtype=pd.StringDtype())
s

In [ ]:
# string arrayts generally use much less memory and are frequently computationally more efficient on large datasets
# another important extension type is Categorical
# extension types can be passed to the Series .astype() method, in data cleaning process
df = pd.DataFrame({"A":[1,2,None,4],
                  "B":["one","two","three",None],
                  "C":[False,None,False,True]})
df

In [ ]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

In [ ]:
# pandas extension data types
# BooleanDtype : Nullable Boolean data, use 'boolean' when passing as string
# CategoricalDtype : Categorical data type, use 'category' when passing as string
# DatetimeTZDtype : Datetime with time zone
# Float32Dtype : 32-bit nullable floating point, use "Float32" when passing as string
# Float64Dtype : 64-bit nullable floating point, use "Float64" when passing as string
# Int8Dtype : 8-bit nullable signed integer, use "Int8" when passing as string
# Int32Dtype : 32-bit nullable signed integer, use "Int32" when passing as string
# Int64Dtype : 64-bit nullable signed integer, use "Int64" when passing as string
# UInt8Dtype : 8-bit nullable unsigned integer, use "UInt8" when passing as a string
# UInt16Dtype : 16-bit nullable unsigned integer, use "UInt16" when passing as a string
# UInt32Dtype : 32-bit nullable unsigned integer, use "UInt32" when passing as a string
# UInt64Dtype : 64-bit nullable unsigned integer, use "UInt64" when passing as a string

In [ ]:
# 7.4 String Manipulation

In [ ]:
# Python built-in String Object Methods
# comma-separated string can be broken into pieces with .split()
val = "a,b, guido"

In [ ]:
val.split(",")

In [ ]:
# .split() is often combined with strip to trim whitespace (including line breaks)
pieces = [x.strip() for x in val.split(",")]
pieces

In [ ]:
# these substrings could be concatenated together with a two-colon delimiter using addition
first, second, third = pieces
pieces

In [ ]:
first + "::" + second + "::" + third

In [ ]:
# but this isn't a practial generic method; a faster and more Pythonic way is to pass a list or tuple to the .join()
"::".join(pieces)

In [ ]:
# other methods are concerned with locating substrings
# using "in" keyword is the best way to detect a substring, though index and find can also be used
"guido" in val

In [ ]:
val.index(",")

In [ ]:
val.find(":")

In [ ]:
# note that the difference between .find() and .index();
# that index raises an exception if the string isn't found (versus returning -1)
val.index(":")

In [ ]:
# .count() returns the number of occurrences of a praticular substring
val.count(",")

In [ ]:
# .replace will substitute occurrences of one pattern for another
# it is commonly used to delete patterns, too, by passing an empty string
val.replace(",","::")

In [ ]:
val.replace(",","")

In [ ]:
# Python built-in string methods
# .count() : Return the number of nonoverlapping occurrences of substring in the string
# .endswith() : Return True if string ends with suffix
# .startswith() : Return True if string starts with prefix
# .join() : Use string as delimiter for concatenating a sequence of other strings
# .index() : Return starting index of the first occurrence of passed substring if found in string;
#            otherwise, raises ValueError if not found
# .find() : Return position of first character of first occurrence of substring in the string;
#           like index, but returns -1 if not found
# .rfind() : Return postion of first character of last occurrence of substring in the string;
#           returns -1 if not found
# .replace() : Replace occurrences of string with another string
# .strip(), .rstrip(), .lstrip() :
# Trim whitespace, including newlines on both sides, on the right side, or on the left side
# .split() : Break string into list of substrings using passed delimiter
# .lower() : Convert alphabet characters to lowercase
# .upper() : Convert alphabet characters to uppercase
# .casefold() : Convert characters to lowercase, and convert any region-specific varable character combinations to a common comparable form
# .ljust(), .rjust() : Left justify or right justify, respectively;
#                     pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width

In [61]:
# Regular Expressions
# regular expressions provide a felxible way to search or match string patterns in text
# a single expression, commonly called regex, is a string formed according to the regular expression language

# re module functions fall into three categories:
# pattern matching, substitution, and splitting
# splitting a variable number of whitespace characters - tabs, spaces, and newlines
# the regex describing one or more whitespace characters is \s+:

import re
text = "foo  bar\tbaz \tqux"
text

'foo  bar\tbaz \tqux'

In [62]:
re.split(r"\s+",text)

['foo', 'bar', 'baz', 'qux']

In [ ]:
# always use r for regex pattern; r stands for "Raw"
# \s means "any whitespace"; + means "one or more"
# and import re! so, re.split(r"\s+", text) is like Excel's TRIM()

In [64]:
# when calling re.split(r"\s+", text), the regex is first compiled, and then its .split() is called on the passed text
# can compile the regex yourself with re.compile(); this forms a reusable regex object
regex = re.compile(r"\s+")

In [65]:
regex

re.compile(r'\s+', re.UNICODE)

In [66]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [67]:
# instead, if wanted to get a list of all patterns matching the regex, can use .findall()
regex.findall(text)

['  ', '\t', ' \t']

In [68]:
# creating a regex object with re.compile() is highly recommended, for saving CPU cycles

In [69]:
# match and search are closly related to .findall()
# while .findall() returns all matches in a string, .search() returnls only the first match
# .match() only matches at the beginning of the string
# email addresses as example
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# [A-Z0-9._%+-] : Find those patterns, any character in that is allowed
# + : "one or more"
# @ : find "@"
# [A-Z0-9.-] : A-Z, 0-9, ., - are allowed
# + = "one or more"; \. : find "."
# [A-Z]{2,4} : find A-Z but between 2 and 4 charecters long (e.g. .com, .de, .info)

regex = re.compile(pattern,flags=re.IGNORECASE)
# compile (contain) from the object "pattern" into object "regex", ignore cases

In [70]:
# using .findall()
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [71]:
# .search() returns a special match object for the first email address in the text
# .match() object can only tell us the start and end position of the pattern in the string
m = regex.search(text)
m

In [72]:
text[m.start():m.end()]

'dave@google.com'

In [73]:
# regex.match returns None, as it will match only if the pattern occurs at the start of the string
print(regex.match(text))

None

In [74]:
# .sub() will return a new string with occurrences of the pattern replaced by a new string
print(regex.sub("REDACTED",text))

# .sub() functions like Excel's "Find and replace"

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [79]:
# suppose you want to segment each addres into 3 components - user name, domain name, and domain suffix
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern,flags=re.IGNORECASE)

In [80]:
# returning a tuple of pattern components with .groups() method
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [83]:
# findall() returns a list of tuples when pattern has groups
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [84]:
# .sub() also has access to .groups() in each .match() using special symbols; \1 \2
# \1 corresponds to the first matched group, \2 corresponds to the second, and so forth
print(regex.sub(r"Username:\1,Domain:\2,Suffix:\3",text))

Dave Username:dave,Domain:google,Suffix:com
Steve Username:steve,Domain:gmail,Suffix:com
Rob Username:rob,Domain:gmail,Suffix:com
Ryan Username:ryan,Domain:yahoo,Suffix:com

In [85]:
# more regular expressions
# .findall() : Return all noneoverlapping matching patterns in a string as a list
# .finditer : Like .findall() but returns an iterator
# .match() : Match pattern at start of the string and optionally segment pattern components into groups;
#            if the pattern matches, return a match object, and otherwise None
# .search() : Scan string for match to pattern, returning a match object if so;
#             unlike .match(), the match can be anywhere in the string
# .split() : Break string into pieces at each occurrence of pattern
# .sub(), .subn() : Replace all (sub) or first n occurrences (subn) of pattern in string with replacement expression;
#                   use symbols \1, \2, ... to refer to match group elements in the replacement string

In [86]:
# String Functions in pandas
# cleaning up messy string data; dealing with missing data
data = {"Dave":"dave@google.com","Steve":"steve@gmail.com",
       "Rob":"rob@gmail.com","Wes":np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [87]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [ ]:
alphabet = ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"]
alphabet

In [ ]:
decode_this = alphabet[18] + alphabet[7] + alphabet[8] + alphabet[19]
decode_this